# FlowConfigMismatch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GenericMEPFailures..::..FlowConfigMismatch Property
BuiltInFailures..::..GenericMEPFailures Class See Also
---
[Element Name]: It is not possible to calculate the flow since all the components in this system have the flow configuration set to Preset or System. At least one component is required to have the flow configuration set to Calculated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FlowConfigMismatch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FlowConfigMismatch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FlowConfigMismatch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GenericMEPFailures Class
Autodesk.Revit.DB Namespace